Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །གང་གཞན་ཡང་དེ་ལ་གནོད་པར་སེམས་པ་དང་ལྡན་པ་བདུད་ཀྱི་ཕྱོགས་སམ། མུ་སྟེགས་ཅན་ལ་སོགས་པ་དེ་དག་ཀྱང་། ཐབས་ཀྱིས་བདག་གི་གདམས་པ་དང་། རྗེས་སུ་བསྟན་པ་འཛིན་དུ་འཛུག་གོ།
en: Furthermore, they skillfully get Māra’s minions or tīrthikas and so on who bear ill will toward them to take their advice and instructions to heart.

source: །གང་དག་དེའི་ངག་ཉན་དུ་མི་བཏུབ་པ་དེ་དག་ཀྱང་ཀླད་པ་འགས་པ་ལ་སོགས་པའི་ཚོར་བས་བསྙད་དེ་བསྡིགས་ནས་བདག་གི་ཚིག་ཉན་དུ་འཇུག་གོ།
en: They even get those who are unwilling to listen to what they have to say by threatening them with splitting headaches and so on.

source: །བྱང་ཆུབ་སེམས་དཔའ་དུས་དང་དུས་མ་ཡིན་པ་ལ་སོགས་པ་ལ་གཟིགས་པ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའི་ངག་ལས་འགལ་བར་བྱེད་པའི་སེམས་ཅན་ནི་སེམས་ཅན་གྱི་རིས་ན་གང་ཡང་མེད་དེ།
en: Bodhisattvas always see when it is the right time and it is not the right time and so on. Among the classes of beings there are none who are offended by the speech of the bodhisattvas.

source: འདི་ནི་བསྡུ་བའི་དངོས་པོའི་བསོད་ནམས་ཡོངས་སུ་བསྔོ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པའི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱི་ཆོས་ཉིད་ཅེས་བྱའོ།
en: This is the very nature of the power of the dedication of the merit from the four ways of gathering a retinue and the merit of the perfections.

source: །དེ་བས་ན་གཟུང་བའི་ཚིག་དང་ལྡན་པ་ཞེས་བྱའོ།
en: Hence they are with speech worth listening to.

source: །ཡོན་ཏན་འདི་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྦྱོར་བ་རྣམ་པར་དག་པ་ཡིན་པར་བསྟན་པའི་ཕྱིར། ཚུལ་འཆོས་པ་མེད་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: To teach that bodhisattvas with these good qualities have a pure practice it says they are not hypocrites and so on.

source: །སྔར་སར་ཆུད་པ་རྣམས་ལ་ཡང་ལོག་པར་འཚོ་བའི་ལས་རྣམས་མི་སྲིད་ན་ཁྱད་པར་དུ་དྲི་མ་མེད་པའི་ས་ལ་སོགས་པ་ལ་ལྟ་ག་ལ་ཞིག་ཡོད།
en: It is impossible that those who have earlier entered onto a bodhisattva level would pursue wrong livelihoods, and this is particularly more so the case on the Vimalā level and so on.

source: འདིར་ས་བདུན་པ་ལ་ལོག་པར་འཚོ་བའི་ལས་རྣམས་མེད་བཞིན་དུ་ཅིའི་ཕྱིར་བསྟན་ཞེ་ན།
en: So why teach here that on the seventh level there is no pursuit of wrong livelihoods?

source: འདི་ལ་ཉེས་པ་མེད་དེ།
en: There is no fault.

source: འོག་མ་རྣམས་སུ་སྤངས་སུ་ཟིན་ཀྱང་རྩོལ་བ་དང་བཅས་པའི་སྤྱོད་པ་འདིར་ཡོངས་སུ་རྫོགས་པས་ཐ་མར་བསྟན་པར་བྱ་བ་ཡིན་ནོ།
en: Even though on lower levels they have already eliminated them, behavior that is pursued with effort is perfected here, so it has to be taught at the end.

source: །ས་བདུན་པ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནི་ཉོན་མོངས་པ་ཞེས་ཀྱང་མི་བྱ། ཉོན་མོངས་པ་མེད་པ་ཞེས་ཀྱང་མི་བྱ་སྟེ། ཉོན་མོངས་པ་ཅན་གྱི་སྤྱོད་པ་རྣམས་འདི་ཉིད་དུ་ཤིན་ཏུ་སྤང་བའི་ཕྱིར་ཏེ།
en: You should not take bodhisattvas standing on the seventh level as “with afflictions” and you should not take them as “without afflictions” either, because right there they absolutely eliminate afflictive behavior.

source: འདི་ལྟར་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པའི་ལུས་ཀྱི་ལས་དང་ལྡན་པ་ཡིན། ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པའི་ངག་དང་།
en: Thus, the purity of their surpassing aspiration informs their physical actions, verbal actions, and mental actions.

source: ཡིད་ཀྱི་ལས་དང་ལྡན་པ་ཡིན་ཏེ། གང་དག་དེ་བཞིན་གཤེགས་པས་སྨད་པའི་ལུས་དང་། ངག་དང་ཡིད་ཀྱི་ལས་དེ་དག་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་ཀུན་ཏུ་མི་འབྱུང་བ་འདི་ནི་ས་བདུན་པ་ཉིད་ཀྱི་ཡོན་ཏན་ཏེ།
en: This total nonarising of all the physical, verbal, and mental actions that the tathāgatas criticize is a quality of the seventh level.

source: དེ་བས་ན་དེ་ལ་ལོག་པར་འཚོ་བའི་ལུས་ཀྱི་ལས་མེད་པར་བསྟན་པའི་ཕྱིར་ཚུལ་འཆོས་པ་མེད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence, to demonstrate that they do not engage in the physical actions of wrong livelihood it says they are “not hypocrites.”

source: །རྙེད་པ་འདོད་པས་ཡ་མཚན་དུ་འཛིན་དུ་གཞུག་པའི་ཕྱིར་གཞན་དག་ལ་སྤྱོད་ལམ་དུ་གཏོགས་པའི་ལུས་ཀྱི་སྦྱོར་བ་བསྟན་པ་ནི་ཚུལ་འཆོས་པ་ཞེས་བྱའོ།
en: Because of wanting to gain something, the demonstration of a physical action that is a way of impressing another is called hypocrisy.

source: །ངག་གི་ལས་ཡོངས་སུ་མ་དག་པ་མེད་པར་བསྟན་པའི་ཕྱིར། ཁ་གསག་མེད་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To demonstrate that they have no impure verbal actions it says they are not fawners.

source: རྙེད་པ་དང་འབྲེལ་པའི་ཚིག་གི་སྦྱོར་བ་རྙེད་པ་འདོད་པ་ཉིད་ཀྱི་ཕྱིར་སྨྲ་བ་ནི་ཁ་གསག་ཅེས་བྱའོ།
en: Acts of speech connected with gaining something, speaking to gain something you really want, is fawning.

source: །ཡིད་ཀྱི་ལས་ཡོངས་སུ་མ་དག་པ་མེད་པར་བསྟན་པའི་ཕྱིར་ཤེས་ཀྱི་ཁེ་དང་རྙེད་པའི་སེམས་མེད་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To demonstrate that they have no impure mental actions it says they are without thoughts of reputation and gain.

source: སྙན་པ་དང་བརྗོད་པ་དང་གྲགས་པ་དང་། ཤེས་ཀྱི་ཁེ་ཞེས་བྱ་བ་ནི་རྣམ་གྲངས་སུ་གཏོགས་པའོ།
en: Praise, citation, renown, and “reputation” are synonymous.

source: །རྙེད་པ་དང་། བཀུར་སྟིའི་སེམས་དང་བྲལ་བས་དེ་སྐད་ཅེས་བྱའོ།
en: They are so called because they are without thoughts of gain or respect.

source: །དེ་ལྟར་ཡོངས་སུ་མ་དག་པའི་སྦྱོར་བ་མེད་པར་བསྟན་ནས། ཡོངས་སུ་དག་པའི་སྦྱོར་བ་ཡོད་པར་བསྟན་པའི་ཕྱིར་ཟང་ཟིང་མེད་པའི་ཕྱིར། སེམས་ཀྱིས་ཆོས་སྟོན་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Having taught that they have no impure practices, to teach that they have purified practices it says they are Dharma teachers without thought of compensation.

source: སྙིང་རྗེས་ཡང་དག་པར་བསྐུལ་ཅིང་། ཤེས་རབ་ཀྱིས་སྦྱངས་པའི་ཡིད་དང་ལྡན་པ་ནི། སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་ཆོས་སྟོན་པས་ན་དེ་སྐད་ཅེས་བྱའོ།
en: This is said of those stirred by compassion and endowed with a thinking mind honed by wisdom who teach Dharma to help beings.

source: །དེ་ལྟར་རྣམ་པ་དེ་དག་གིས་ས་བདུན་པ་མན་ཆད་རྩོལ་བ་དང་བཅས་པར་མཚན་མ་མེད་པ་ལ་སྤྱོད་པའི་ཡོན་ཏན་བསྟན་ནས། ད་ནི་ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ཕ་རོལ་དུ་སོན་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་ལྷུན་གྱིས་གྲུབ་པར་མཚན་མ་མེད་པ་ལ་གནས་པའི་ཡོན་ཏན་སྟོན་ཏེ། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས།
en: Thus, having taught in these ways the qualities of those from the seventh level on down who practice signlessness with effort, now it says they are with perfect forbearance for the deep dharmas and so on, to teach the quality of standing effortlessly in signlessness.

source: ས་བརྒྱད་པ་ཡན་ཆད་རྩོལ་བ་ཐམས་ཅད་རྒྱུན་ཆད་ནས། མཚན་མ་དང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: Thus, from the eighth level on up bodhisattvas cut the continuum of all effort and pass beyond all causal signs and conceptualization.

source: རང་དགར་བྱེད་པས་རྩོལ་བ་ཅི་ཡང་མེད་དོ།
en: They do so in a carefree way, without any effort at all.

source: །དེ་དག་ནི་ཤིན་ཏུ་ཞི་ཞིང་རྩོལ་བ་མེད་མོད་ཀྱི་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སེམས་ཅན་གྱི་དོན་སྤྱད་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་སྤྱོད་པ་མངོན་དུ་འགྱུར་རོ།
en: But even though they are totally at peace and expend no energy, they live a life for the sake of others because of the force of their previous prayers, and they realize the practices on the side of awakening.

source: །ས་བརྒྱད་པ་དེ་ལ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་བསྟན་པའི་ཕྱིར། ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ཕ་རོལ་དུ་སོན་པ་ཞེས་བྱ་བ་གསུངས་ཏེ། འདི་ལྟར་དེ་རྣམ་པ་ཐམས་ཅད་དུ་སེམས་དང་།
en: To teach that on the eighth level they have gained forbearance for the nonproduction of dharmas, it says they are those “with perfect forbearance for the deep dharmas.”

source: ཡིད་དང་། རྣམ་པར་ཤེས་པའི་རྣམ་པར་རྟོག་པའི་འདུ་ཤེས་དང་བྲལ་ཞིང་ཐོགས་པ་མེད་ལ། ནམ་མཁའ་དང་འདྲ་ཞིང་བླ་གབ་མེད་པའི་རང་བཞིན་དུ་ཁོང་དུ་ཆུད་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་ཞེས་བྱའོ།
en: Thus, completely free from the conceptual discriminations of mind, thinking mind, and consciousness, unhindered like space, with the comprehension of the wide-open nature they have gained forbearance for the nonproduction of dharmas.

source: །རྒྱལ་བའི་སྲས་དག་དེ་ལ་བཟོད་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ས་མི་གཡོ་བ་ཐོབ་མ་ཐག་ཏུ།
en: O bodhisattvas!

source: བྱང་ཆུབ་སེམས་དཔའི་གནས་ཟབ་མོ་ཤེས་པར་དགའ་བ་ཐ་མི་དད་པ། མཚན་མ་ཐམས་ཅད་དང་བྲལ་བ་ཐོབ་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: The moment bodhisattvas with such a forbearance for that have reached the Acalā level, they gain the bodhisattva’s deep stations that are hard to understand, undifferentiated, free from all causal signs, and so on.

source: །བྱང་ཆུབ་སེམས་དཔའི་གནས་པ་ཟབ་མོ་དེ་ལྟ་བུ་དེ་དག་ལས་ལྷག་པར་ཟབ་པ་གཞན་མེད་པའི་ཕྱིར་ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ཕ་རོལ་དུ་སོན་པ་ཞེས་བྱའོ། །དེ་ལྟར་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་།
en: There are no other stations deeper than such deep stations of bodhisattvas, so it says they have “perfect forbearance for the deep dharmas.”

source: ལྷ་དང་ཚངས་པའི་འཁོར་དང་། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། མུ་སྟེགས་ཅན་དང་བདུད་ཀྱི་འཁོར་གང་དང་། གང་དུ་འགྲོ་བ་དེ་དག་ཐམས་ཅད་དུ་འཇིགས་པ་མེད་ཅིང་བག་ཚ་བ་མེད་པར་འགྲོ་ལ་འཛེམ་པ་མེད་པར་སྨྲའོ།
en: Wherever they go, bodhisattvas who have gained such forbearance go with fearlessness and without trepidation, be it into a retinue of persons of royal caste, brahmins, persons of business caste, persons of low caste, gods, or Brahmās, or into a retinue of monks, nuns, tīrthikas, or Māras, and speak without feeling shy.

source: དེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པས་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པའི་རྣམ་པར་རྣམ་པ་ཐམས་ཅད་དུ་རྟོགས་པའི་ཕྱིར་རོ།
en: It is because they have gained forbearance for the nonproduction of dharmas and therefore fully realize the nonproduction aspect of all dharmas.

source: །དེ་བས་ན་འདི་ལ་འཁོར་གྱི་ནང་དུ་མི་ཤེས་པ་ལས་བྱུང་བའི་འཇིགས་པ་མེད་དོ།
en: Therefore, they do not have the fear that comes from not knowing something when in the midst of a retinue.

source: །བག་ཆགས་མ་གཏོགས་པར་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཤིང་སྐྱེ་བ་མེད་པ་ཉིད་དུ་མཐོང་ངོ་།
en: Apart from their residual impressions, they have eliminated all affliction, seeing it has not been produced, so they do not have the fear that comes from the afflictions.

source: །དེ་ལྟ་བས་ན་འདི་ལ་འཁོར་གྱི་ནང་དུ་ཉོན་མོངས་པ་ལས་བྱུང་བའི་འཇིགས་པ་མེད་དེ་དེའི་ཕྱིར་མི་འཇིགས་པ་འཐོབ་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence it says they had obtained the fearlessnesses.

source: །མི་རྫི་བ་ཡིན་པར་བསྟན་པའི་ཕྱིར་བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: To teach that they are indomitable it says they had transcended all the works of Māra.

source: བདུད་ཀྱི་ལས་གང་འོག་ནས་འཆད་པ་རྣམས་དང་། མདོ་གཞན་དག་ལས་བདུད་ཀྱི་ལས་བཤད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ལས་རིང་བ་བས་ཀྱང་ཆེས་རིང་བར་ཡང་དག་པར་འདས་པ་ཡིན་ནོ།
en: They have transcended by far and transcended even farther than that all the works of Māra described below [ ff.], as well as the works of Māra described in other sūtras.

source: །ལས་ཀྱི་སྒྲིབ་པ་རྒྱུན་བཅད་པ་ཞེས་བྱ་བ་ནི།
en: They have cut the continuum of karmic obscuration.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས། མ་འོངས་པའི་སྐྱེ་བོ་རྣམས་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར། དེ་ལྟ་དེ་ལྟར་སྐྱེ་བ་བསྟན་པ་མ་གཏོགས་པར་བཟོད་པ་དེ་ཐོབ་མ་ཐག་ཏུ་དེའི་བདེ་འགྲོ་དང་། ངན་འགྲོར་རྣམ་པར་སྨིན་པར་འགྱུར་བའི་ལས་ཀྱི་སྒྲིབ་པ་གང་ཡིན་པ་དེ་དག་འདི་ལ་རྒྱུན་ཆད་པ་ཡིན་ནོ།
en: When it comes to their future lives, apart from the sorts of births they demonstrate because of compassion, as soon as they have attained this forbearance they have cut the continuum of the karmic obscurations that ripen into good or bad forms of life.

source: །ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་ཅིང་རྣམ་པར་དབྱེ་བ་སྟོན་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་ལ་ཆོས་ནི་ཕུང་པོ་དང་ཁམས་ལ་སོགས་པ་ལྷག་མཐོང་གི་ཆོས་རྣམས་དང་།
en: They are skillful in expounding the analysis of investigations into phenomena. “

source: དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་ལ་སོགས་པ་བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་ཆོས་རྣམས་དང་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། རྒྱུན་དུ་ཞུགས་པའི་ལམ་གྱི་འབྲས་བུ་ལ་སོགས་པ་ཐོབ་པའི་ཆོས་རྣམས་སོ། །དེ་དག་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ནི།
en: Phenomena” are the aggregates, constituents, and so on, or dharmas known by special insight; the applications of mindfulness, the right efforts, and so on, or the dharmas on the side of awakening; the ten powers, four fearlessnesses, and so on, or the buddhadharmas; and the result of the stream enterer path and so on, or gained dharmas. “

source: མཚན་ཉིད་དང་། བྱེད་པ་དང་། རྒྱུ་དང་། འབྲས་བུ་དང་། གྲངས་དང་། རོ་མྱང་བ་དང་། ཉེས་དམིགས་དང་། འབྱུང་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། ཡོངས་སུ་ཤེས་པ་དང་། སྤང་བ་དང་། མངོན་སུམ་དུ་བྱ་བ་དང་། བསྒོམ་པ་དང་། གང་དག་ཡང་ཕྱི་རོལ་གྱི་ཆོས་འཇིག་རྟེན་གྱི་ཁམས་འདི་ལྟར་འབྱུང་ངོ་། །འདི་ལྟར་འཇིག་པར་འགྱུར་རོ། །འདི་ལྟར་འཇིག་གོ། །འདི་ལྟར་ཆགས་སོ། །དུས་འདི་སྲིད་ཅིག་ཏུ་འཇིག་གོ། །འཆགས་སོ། །དུས་འདི་སྲིད་ཅིག་ཏུ་གནས་སོ། །འདི་དག་ནི་སེམས་ཅན་དམྱལ་བའོ། །འདི་དག་ནི་དུད་འགྲོའི་སྐྱེ་གནས་སོ། །འདི་དག་ནི་{ཡི་དགས་,ཡི་དྭགས་}སོ། །འདི་དག་ནི་མིའོ། །འདི་དག་ནི་འདོད་པའི་ཁམས་སོ། །འདི་དག་ནི་གཟུགས་ཀྱི་ཁམས་སོ།
en: Investigations” of them are into marks, functions, causes, results, number, proper meditative experiences, faulty ones, elements, defilements, purifications, comprehensions of suffering, eliminations of origins, cessations to be actualized, and cultivations of paths.

source: །འདི་དག་ནི་གཟུགས་མེད་པའི་ཁམས་སོ། །སའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ནི་འདི་སྙེད་ཅིག་གོ། །ཆུའི་ནི་འདི་སྙེད་ཅིག་གོ། །མེའི་ནི་འདི་སྙེད་ཅིག་གོ། །རླུང་གི་ནི་འདི་སྙེད་ཅིག་གོ། །ཁོར་ཡུག་ལ་སོགས་པའི་རྔམས་དང་། རྒྱ་དང་། འཕང་དང་། ཟབས་ཀྱི་ཚད་ནི་འདི་ཙམ་མོ། །གླིང་བཞི་པ་ནི་འདི་ཙམ་མོ། །སྟོང་གཅིག་ནི་འདི་ཙམ་མོ། །སྟོང་གཉིས་ནི་འདི་ཙམ་མོ། །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ནི་འདི་ཙམ་མོ་ཞེས་བྱ་བ་དང་།
en: They are also investigations into the outer dharmas: world systems arise like this, will perish like this, have perished like this; they form like this, they perish for that length of time, they stay like that, they last this length of time; these are hell beings, these are birthplaces of animals, these are ghosts, these are humans, these are in the desire realm, these in the form realm, these in the formless realm; these are how many of the smallest earth, water, fire, and wind atoms there are; just this is the measure of the height, breadth, width, and depth of the earth and so on; and just these are the four continents, just this is a thousand of them, just this is a million, and just this a billion.

source: དེ་བཞིན་དུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་བ་དང་། སྤྱོད་པ་དང་། མོས་པ་དང་། དབང་པོ་དང་། སྐྱོན་ཆུང་བ་དང་། སྐྱོན་མང་བ་དང་། རིགས་ཡོད་པ་དང་། རིགས་མེད་པ་དང་། ངེས་པ་དང་། མ་ངེས་པ་དང་། ཞུགས་པ་དང་། མ་ཞུགས་པ་དང་། ཡོངས་སུ་སྨིན་པ་དང་། ཡོངས་སུ་མ་སྨིན་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་མ་གྲོལ་བ་དང་།
en: Similarly, the investigations are the sort that investigate the intentions, propensities, behaviors, beliefs, and faculties of all the worlds: who is less at fault, who more; who is in a lineage, who is not; who is definitely in a lineage, who is not; who is a candidate, who is not; who is mature, who is not; and who is free and who is not.

source: འདི་ལྟ་བུའི་ཚུལ་ཅན་དག་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ནི་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཞེས་བྱའོ།
en: These are the “investigations into phenomena.”

source: །རྣམ་པར་འབྱེད་པ་ནི་ཆོས་རྣམས་བྱེ་བྲག་ཏུ་དབྱེ་བ་སྟེ། འདི་དག་ནི་ཕུང་པོ་རྣམས་སོ། །འདི་དག་ནི་ཁམས་རྣམས་སོ། །འདི་དག་ནི་སྐྱེ་མཆེད་རྣམས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྔར་སྨོས་པའི་ཆོས་དེ་དག་ཐམས་ཅད་སོ་སོར་ཡོངས་སུ་དབྱེ་བ་དང་།
en: To “analyze” is to divide those phenomena described earlier into specific categories: “these are the aggregates, these the constituents, these the sense fields,” and so on.

source: མང་པོ་བྱེ་བྲག་ཏུ་དབྱེ་བ་ལ་རྣམ་པར་དབྱེ་བ་ཞེས་བྱའོ།
en: There are the categories when they have all been categorized, when they have been divided into many specific types.

source: །སྟོན་པ་ནི་དེ་རྣམས་གཞན་དག་ལ་ཡང་དག་པར་སྟོན་ཅིང་ཤེས་པར་བྱེད་དོ།
en: To “expound” is to teach them and make them understandable to others. “

source: །མཁས་པ་ནི་དེ་ལ་རབ་ཏུ་ཤེས་པའོ།
en: Skill” is intelligence. “

source: །དེ་ལ་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ནི་ཆོས་སོ་སོར་ཡང་དག་པར་རིག་པའོ། །རྣམ་པར་དབྱེ་བ་ནི་དོན་སོ་སོར་ཡང་དག་པར་རིག་པའོ། །སྟོན་པ་ནི་ངེས་པའི་ཚིག་སོ་སོར་ཡང་དག་པར་རིག་པའོ། །སྟོན་པ་ལ་མཁས་པ་ནི་སྤོབས་པ་སོ་སོར་ཡང་དག་པར་རིག་པའོ།
en: Investigation into phenomena” is detailed and thorough knowledge of phenomena; “categorization,” or analysis, is detailed and thorough knowledge of content; “expounding” is detailed and thorough knowledge of languages; and “skill in expounding” is detailed and thorough knowledge of ready speech.

source: །དེའི་ཕྱིར་ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་ཅིང་རྣམ་པར་དབྱེ་བ་སྟོན་པ་ལ་མཁས་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Thus, it says they are “skillful in expounding the analysis of investigations into phenomena.”

source: །དེ་ལྟར་ས་བརྒྱད་པའི་ཡོན་ཏན་བསྟན་ནས། །ས་གོང་མ་དག་ལ་སྤྱོད་པ་ངེས་པའི་སའི་ཡོན་ཏན་བསྟན་པའི་ཕྱིར་བསྐལ་པ་གྲངས་མེད་པ་ནས་སྨོན་ལམ་ཤིན་ཏུ་བརྩམས་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Having thus taught the eighth level qualities, to teach the qualities of the practice on the levels above, on the levels of those who are destined, it says they are those with the prayer that is a vow made during an asaṃkhyeya of eons really fully carried out.

source: །བསྐལ་པ་གྲངས་མེད་པ་རྣམས་སུ་སྨོན་ལམ་བཏབ་པའི་སྨོན་ལམ་གང་ཡིན་པ་དེ་དག་གིས་ཤིན་ཏུ་བརྩམས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དག་གོ།
en: These are bodhisattvas whose “prayer that is a vow” made during “an asaṃkhyeya of eons” has been “really fully carried out.”

source: །འདིས་ཅི་ཞིག་བསྟན་ཅེ་ན།
en: What is this teaching?

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་ཕན་ཅད་གང་ནང་གི་གཟུགས་ཀྱི་ལུས་དེ་ནི་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་སྣང་བར་མི་འགྱུར་རོ།
en: There are no appearances of inner physical bodies anywhere at all after the forbearance for the nonproduction of dharmas has been gained.

source: །མིང་གི་ཚོགས་ཀྱང་སེམས་པ་དང་། ཡིད་དང་རྣམ་པར་ཤེས་པའི་རྣམ་པར་མི་འཇུག་སྟེ། སྟོང་པའི་རྣམ་པ་ཉིད་དུ་ཡང་དག་པར་གནས་སོ།
en: The body of names does not operate in the form of intention, thinking mind, and consciousness; it remains perfectly in the form of emptiness.

source: །ཕྱིའི་ཆོས་ཁམས་གསུམ་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་སྣང་བར་མི་འགྱུར་ཏོ། །མཚན་མ་མེད་པའི་དབྱིངས་རྣམ་པར་ཐར་པ་ཉིད་དུའོ།
en: External dharmas—the three realms—do not appear at all; they are in a state of liberation that is the element of signlessness.

source: །དེ་ལྟར་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་པར་གནས་པ་དེ་ལ། རྩོལ་བ་ཐམས་ཅད་དང་། གཡོ་བ་དང་། རློམ་སེམས་དང་། སྤོས་པ་ཐམས་ཅད་འབྱུང་བར་མི་འགྱུར་རོ།
en: For those who thus abide perfectly extinguished in suchness, no effort, movement, false projection, or thought construction occurs.

source: །སེམས་དཔའ་ཆེན་པོ་དེ་དེ་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དང་། གཟོད་མ་ནས་ཞི་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དུ་གནས་ན་ཕྱིས་སངས་རྒྱས་སུ་བྱེད་པའི་ཆོས་རྣམས་དང་། སེམས་ཅན་གྱི་དོན་གང་ཡིན་པ་དེ་དག་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ་ཞེ་ན།
en: If those great beings thus dwell totally in nirvāṇa, in the nonexistence of an intrinsic nature, in primordial calm, in the intrinsic nature of the dharma-constituent, they would subsequently veer away from the attributes that would make them a buddha and from the welfare of beings.

source: དེ་ཡོངས་སུ་མི་ཉམས་པར་བྱ་བའི་ཕྱིར། བསྐལ་པ་གྲངས་མེད་པ་གཉིས་སུ་ཡོངས་སུ་རྫོགས་པར་བྱས་པའི་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐབས་མཁས་པ་དང་བཅས་པ་སྙིང་རྗེའི་རྒྱུ་མཐུན་པར་འགྱུར་བས། དེའི་ཚེ་རྣམ་པར་སྨིན་པར་ཡོངས་སུ་བསྒྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཡང་ཀུན་རྫོབ་ལ་འཇུག་སྟེ།
en: Response: The perfection of prayer that has been made complete during two incalculable eons, together with skillful means, becomes a concordant cause of compassion on account of which, at that time, in order not to veer away the maturation is developed, and those bodhisattvas again enter into the conventional.

source: ཀུན་རྫོབ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ནང་དང་ཕྱིའི་འཇིག་རྟེན་ཐམས་ཅད་སྔོན་གྱི་དུས་བཞིན་དུ་ཡང་དམིགས་པར་འགྱུར་ལ།
en: Those bodhisattvas who have entered into the conventional apprehend all inner and outer worlds just as at an earlier time.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་སྤྱོད་པ་ལ་སྦྱོར་རོ།
en: At that time, they practice the bodhisattva’s course of conduct and so on.

source: །དེ་ལྟ་ན་ས་འདི་ལ་ཉོན་མོངས་པ་ཀུན་ཏུ་འབྱུང་བ་ཐམས་ཅད་མེད་པས་ཕྱི་མ་ལ་སྐྱེ་བ་གཞན་འབྱུང་བར་འགྱུར་བའི་ལས་བསགས་པ་མེད་ལ།
en: Qualm: In that case, since at this level all affliction that is the origin of suffering does not exist, they do not accumulate the karma that gives rise to future lives.

source: སྔོན་གྱི་དུས་ན་བསགས་པའི་ལས་རྣམས་ནི། དགྲ་བཅོམ་པ་རྣམས་ཀྱི་བཞིན་དུ་མཐུ་ཟད་པར་གྱུར་ན། དེ་ལ་ལས་མེད་པས་རྣམ་པར་སྨིན་པ་ཡང་མི་དམིགས་ན། ཡང་སྐྱེ་བ་གཞན་ལེན་པ་ལྟ་ཇི་ལྟར་འགྱུར།
en: The force of the karma they accumulated previously is extinguished, as it is for worthy ones, so, given that a maturation cannot be apprehended in the absence of karma, how are they going to appropriate another future life?

source: གོང་དུ་ཤིན་ཏུ་མྱུར་བར་མ་བརྩལ་དུ་ཟིན་ཀྱང་གདོན་མི་ཟ་བར་བསྐལ་པ་གྲངས་མེད་པ་གཅིག་གིས་དེ་བཞིན་གཤེགས་པའི་ས་ཐོབ་པར་འགྱུར་ན། དུས་དེ་སྲིད་ཀྱི་བར་དུ་དེ་ཇི་ལྟར་གང་གི་བདག་ཉིད་དུ་གནས་པར་འགྱུར་ཞེ་ན།
en: And given that above that level they are sure to swiftly and effortlessly reach the Tathāgata level in a single countless eon, how, in that case and during that period of time, will they abide in the form of anyone?

source: འདི་ལ་ཉེས་པ་མེད་དེ། འདིར་བསྟན་བཅོས་མཛད་པ་དག་གིས་བཤད་པ། སྔོན་བསྐལ་པ་གྲངས་མེད་པ་གཉིས་ཀྱི་བར་དུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་དག་ཡོངས་སུ་རྫོགས་པར་མཛད་དེ། སྔོན་ཐབས་མཁས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་མི་ཟད་པའི་རྣམ་པར་ཡང་དག་པར་བསྒྲུབས་ཤིང་སྨོན་ལམ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་སེམས་ཅན་ལ་ཕན་གདགས་པའི་དོན་དང་། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔས་བཟོད་པ་ཐོབ་པ་ཕན་ཅད་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་ཡོངས་སུ་བསྒྱུར་ཏེ།
en: Response: There is no fault, because here the commentators say that those perfections that bodhisattvas have previously completed during the two incalculable eons—the ones they have previously, through the perfection of skillful means, fully established in a form that is inexhaustible, and that they have through the perfection of prayer dedicated for the benefit of beings and perfect awakening—they all, after forbearance has been attained, are from then on developed into the form of a maturation.

source: དེ་ལྟར་རྣམ་པར་སྨིན་པར་གྱུར་པ་དེ་དག་གིས་འཁོར་བ་ཇི་སྲིད་པར། བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་གྱིས་གྲུབ་པར་སེམས་ཅན་གྱི་དོན་དང་། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྒྲུབ་བོ།
en: Thus, through those maturations bodhisattvas spontaneously, for as long as cyclic existence remains, accomplish the welfare of others and perfect complete awakening.

source: །དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་ཡོངས་སུ་གྱུར་པ་དེ་དག་ཉིད་ཀྱིས་སྐྱེ་བ་གཞན་ལེན་པར་བྱེད་དོ། །དེ་ཡང་དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་དེ་དག་ཉིད་ཀྱིས་སྐྱེས་པའི་རབས་རྣམ་པ་དུ་མ་ཉེ་བར་བསྟན་ཏེ། སྤྲུལ་པ་ཤིན་ཏུ་མང་པོ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་གྱི་དོན་མཛད་ནས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་དེ། དེ་བཞིན་གཤེགས་པའི་ས་འཐོབ་པོ་ཞེས་བཤད་དོ།
en: In just those forms that are developments of the maturations of their wholesome roots they take other rebirths; in just those forms of the maturations of their wholesome roots give many teachings in those lifetimes; and their many various types of magical creations work for the welfare of living beings, ripen the buddhadharmas, and cause them to reach the Tathāgata level.

source: །དེ་བས་ན་སྤྱོད་པ་འདི་ནི་ངེས་པས་སྤྱོད་པ་ཞེས་བྱ་སྟེ། སྨོན་ལམ་གྱི་མཐུས་མངོན་པར་གྲུབ་པའི་ཕྱིར་རོ།
en: Therefore, this course of conduct is “a certain course of conduct” because it has been brought about through the force of a prayer that is a vow.

source: །སྤྱོད་པ་གཉིས་པ་ནི་སེམས་ཅན་གྱི་དོན་དུ་ངེས་པ་ཡིན་ཏེ། རྣམ་པར་སྨིན་པའི་བདག་ཉིད་ཡིན་པས་དེའི་འཇུག་པ་དོན་མེད་པ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: The second course of conduct is certain in regard to the welfare of beings, because it is in the form of a maturation, and entering into it is not purposeless.

source: །སྤྱོད་པ་འདིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་སེམས་ཅན་རྣམས་ནི། ཐེག་པ་གསུམ་ལ་ངེས་པར་འགྱུར་ཏེ། དེ་བས་ན་ངེས་པར་སྤྱོད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་གཅིག་རངས་པར། སེམས་ཅན་གྱི་དོན་བྱས་པ་ལ་སྔོན་གྱི་སྤྱོད་པ་ཐམས་ཅད་ཀྱིས་བརྒྱའི་ཆར་ཡང་མི་ཕོད། སྟོང་གི་ཆར་ཡང་མི་ཕོད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Beings who have been brought to maturity by this course of conduct are certain in regard to the three vehicles, so it is said that all the courses of conduct done previously for the welfare of others do not amount to even a hundredth or even a thousandth part, and so on, of a bodhisattva’s certain course of conduct entered into even just for the length of a single day.

source: །དེ་ལྟར་སྨོན་ལམ་གྱི་མཐུས་ཡང་དག་པར་གྲུབ་པའི་ཕྱིར་བསྐལ་པ་གྲངས་མེད་པ་ནས་སྨོན་ལམ་གྱིས་ཤིན་ཏུ་བརྩམས་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, because they achieve that through the force of a prayer that is a vow it says that they are those “with the prayer that is a vow made during an asaṃkhyeya of eons really fully carried out.” “
